<template>
  <div class="ptfwxy">
  	<h4>用户注册协议</h4>
  	<p>尊敬的用户（以下简称为“您”）您好，欢迎您与斗宝商城(包含微信小程序、手机客户端、网站等平台，以下简称为“商城”)经营者成都斗宝科技有限公司（以下简称为“斗宝科技”）之间就商城服务等相关事宜签订本协议并使用商城各项服务。</p>
  	<p>在您申请注册流程中点击同意本协议之前，请您仔细阅读本注册协议，充分理解各项条款的内容及含义，特别对于责任免除或责任限制的相关内容及关于法律适用与争议解决内容的相关部分，请您着重阅读。</p>
  	<p>您在认真阅读并充分理解本协议的相关内容后，将通过点击“同意”按钮签署本协议，无论您此后是否完成了商城注册的全部流程，均代表您已充分理解并认可本协议，并已同意接受本协议的全部内容。</p>
  	<p>如您在阅读本协议的的过程中，有任何疑问，可通过商城客服进行咨询；如您不同意本协议或其中任意条款约定，请您立即停止注册程序，并停止使用商城各类服务。</p>
  	<p>本协议各段标题及各条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为准确理解各项条款的相关内容，建议您仔细阅读各条款具体表述。</p>
  	<h6>一、签约主体</h6>
  	<p>1、协议主体：本协议是由您与商城经营者共同缔结，本协议对您和商城经营者均具有约束力。</p>
  	<p>2、商城经营者：商城经营者是指经营斗宝商城的法律主体，本协议下商城的经营者可能根据商城业务调整而发生变更，在商城经营主体变更后，变更后的商城经营者将继续与您共同履行本协议并按本协议的约定向您提供各类服务。</p>
  	<p>3、用户：您应当具备中华人民共和国法律规定的签订本协议、购买相关商品的权利能力和行为能力，如您不具备前述与您相适应的民事行为能力，则您需要与您的监护人的参与下才能使用商城服务。否则您及您的监护人将依照法律规定承担因此而导致的一切后果。</p>
  	<h6>二、账户注册及使用规则</h6>
  	<p>1、商城服务使用前提：您必须自行准备如下设备和承担如下开支：（1）联网设备，包括但不限于手机、电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）联网开支，包括但不限于网络接入费、上网设备租用费、手机流量费等。</p>
  	<p>2、账户注册：您需要在阅读并完全同意本协议后，按商城相关提示详尽填写您的真实信息，并完成注册步骤中全部注册程序后，商城将为您提供商城账户，您可以通过您个人的商城账户使用商城的相关服务。</p>
  	<p>3、账户注册限制：每一名用户仅能够注册一个商城账户，如商城有证据或有理由认为您不当注册或使用多个商城账户时，商城可采取冻结或关闭账户、取消订单、拒绝提供服务等措施，如给商城及第三方造成损失的，您还须承担赔偿责任。</p>
  	<p>4、注册要求：商城有权对您提供的个人注册信息进行验证，如遇验证失败，平台有权要求您修改个人注册信息，在您的个人信息通过验证前，商城有权暂停为您提供某些或全部服务。</p>
  	<p>5、账户登录信息：您应妥善保管您的商城账户账号及账号密码，账号密码由您个人自行设置并由您保管，任何情况下商城均不会主动要求您提供您的账号密码。</p>
  	<p>6、账户行为的效力：商城对于任何通过您个人账户的操作行为均视为您个人的操作行为，因此，商城建议您务必保管好您的账户，并确保您在每次使用商城服务后以正确步骤退出商城。账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，商城不承担任何责任，您应通过司法、行政等救济途径向侵权行为人追偿。</p>
  	<p>7、账户安全风险：如您在使用商城账户过程中发现任何未经授权的登录或其他可能导致您账户遭窃、遗失的情况，建议您立即将上述情况通知商城客服人员。您理解商城对您的任何请求采取行动均需要合理的步骤及时间，且商城应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除权力机关通过相关裁定认定商城存在过错情况外，商城不承担相关责任。</p>
  	<p>8、账户的易手：您的商城账户关联您的个人信息，因此您的商城账户不能转让、赠与、遗赠他人使用，除法律规定、司法裁定允许并同意或商城书面批准，否则商城不认可任何用户自行将商城账户易手的行为，由此而产生的一切后果及责任由用户自行承担。</p>
  	<p>9、实名认证：您在使用商城某些服务或购买特定种类的商品时，商城有权根据国家法律法规的相关规定及商城自身相关制度要求您进行实名认证，如您未能通过实名认证，则不能使用商城中的部分服务或购买特定种类的商品。同时，在国家有关法律或制度要求的情况下，商城有权要求每一名商城用户进行实名认证，在此情况下，商城将中止、终止向未能通过实名认证的用户提供某些或全部服务。</p>
  	<p>10、账户信息的维护：您的个人账户信息将由您个人负责维护，当您预留的各类信息发生变化时，商城建议您及时更新维护您的商城信息，以避免由此造成的各类损失。您了解并同意，您有义务保持您提供信息的真实性及有效性，由于信息过期或失效造成的一切责任由您个人承担。</p>
  	<p>11、商城对账户的管理：商城保留在中华人民共和国大陆地区施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑不符合国家相关法律法规及本协议的言论及信息内容或取消订单的权利。</p>
  	<h6>三、浏览、购买及评价</h6>
  	<p>1、商品及服务内容的确认：您在浏览商城所展示、销售的产品和/或服务过程中，请您仔细确认浏览商品的名称、价格、数量、型号、规格、尺寸或服务的时间、内容、限制性要求等重要事项。在您通过商城订单购买产品和/或服务时，除对上述信息进行确认外，您还需对该笔订单的联系地址、电话、收货人等信息进行核实。如您填写的收货人非您本人，则收货人的行为和意思表示产生的法律后果均由您承担。</p>
  	<p>2、合同关系的建立：商城所展示、销售的产品、服务及标注的规格、库存和价格等信息仅仅是要约邀请，您在下单时须填写您希望购买的商品类型、数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，您同意并认可商城将此数据作为您向商城发出的要约。订单由计算机信息系统自动生成后，您可通过付款行为对订单内容进行确认，订单的确认时间已订单生成后的30分钟为限，如您对生成的订单所载内容持有异议，可通过放弃付款的行为取消订单，或主动关闭该笔订单；如您希望继续完成交易，可通过重新填写信息下单的方式修改订单。如您对生成的订单所载内容无异议，应在订单确认时间期满前完成订单款项的支付。当您完成订单款项支付后，视为您与商城建立了合同关系。</p>
  	<p>3、合同关系的未能建立情形：您理解并同意在发生以下情况时，您与商城的合同关系将不能成功建立。（1）尽管商城做出最大的努力，但由于市场变化及各种以合理商业努力难以控制因素的影响，商城无法避免您提交的订单信息中的商品出现缺货情况；如您下单所购买的商品发生缺货，您与商城均有权取消订单，若您已经付款，则由商城为您办理退款。（2）商城时刻将您的利益放在首位，不定期对商城销售的商品及服务进行抽检，如商城发现您下单购买的商品不符合保障人身、财产安全的要求，或者有其他侵害您的合法权益的行为，将采取措施中止商品供应商向您发货或提供服务的行为，以维护您的利益，此等情况下，您与商城均有权取消订单，若您已经付款，则由商城为您办理退款。</p>
  	<p>4、订单被关闭的情况：您的购买行为应当基于真实的消费需求，不得存在对商品和/或服务实施恶意购买、恶意维权等扰乱商城正常交易秩序的行为。基于维护商城交易秩序及交易安全的需要，商城发现上述情形时可主动关闭相关交易订单等操作。</p>
  	<p>5、商品的配送：您在平台购买的商品将按照您订单中指定的送货地址进行配送。商城中列出的送货时间为参考时间，参考时间的计算是供应商历史配送时间的基础上估算而来，并非实际配送时间。您应当清楚准确地填写您的送货地址、联系人及联系方式等配送信息，您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。</p>
  	<p>6、商品的评价功能：您有权在商城提供的评价系统中对与您达成交易的其他用户商品和/或服务进行评价。您应当理解，您在商城的评价信息是公开的，如您不愿意在评价信息中向公众披露您的身份信息，您有权选择通过匿名形式发表评价内容。</p>
  	<p>7、商品评价规则：您的所有评价行为应遵守商城规则的相关规定，评价内容应当客观真实，不应包含任何污言秽语、色情低俗、广告信息及法律法规与本协议列明的其他禁止性信息。您不应以不正当方式帮助他人提升信用或利用评价权利对其他用户实施威胁、敲诈勒索。商城可按照商城规则的相关规定对您实施上述行为所产生的评价信息进行删除或屏蔽。</p>
  	<h6>四、用户信息保护</h6>
  	<p>1、用户信息的收集：为履行国家相关规定及要求及更好地为您提供商城的各项服务，商城会主动、被动收集您的个人信息、支付信息、物流及配送信息、浏览及购买记录等内容，您同意商城按照商城规则收集、储存、使用、披露、及保护您的上述用户信息。</p>
  	<p>2、个人信息：个人信息包含您的个人身份信息，如您的姓名、身份证号码、生物识别信息等能够确认您个人身份的信息；及您的电子邮箱、联系方式、交易信息等能够便于您使用商城服务的相关信息。</p>
  	<p>3、支付信息：支付信息包含您使用的支付方式、绑定的支付账号等相关信息。</p>
  	<p>4、物流及配送信息：物流及配送信息包含您使用及储存的收货信息和收货人信息等相关信息。</p>
  	<p>5、浏览及购买记录：浏览及购买记录包含您在商城浏览商品和/或服务的相关记录及与您历史订单相关的记录信息。</p>
  	<p>6、信息的保护：商城重视对每一名用户的信息保护工作，因此除特定的使用、共享、披露条件及法律法规规定的情形外，商城不会对任何第三方公开、共享、披露、转让您的用户信息，商城将逐步对相关信息采取相关加密储存与传输手段，利用合理措施保障您的用户信息安全。</p>
  	<p>7、信息的使用：为更好地为您提供各项服务，我们将有限的使用您的相关信息，具体表现为：（1）通过合作的第三方平台对您的个人信息及支付信息进行校验，用以完成实名认证、手机绑定、支付方式绑定等工作；（2）通过向商城供应商、合作的物流机构提供您的物流及配送信息，用以完成供应商、物流机构的发货、退货及订单追踪等工作；（3）通过使用您的浏览及购买记录，用以改善商城的产品及服务，便于向您提供更加个性化的信息展示；（4）通过使用您的用户信息，用以进行基于商城数据的相关研究、统计、分析、及预测，为商城的各项决策提供产品或数据支撑；（5）便于为您提供更好服务或改善商城服务的其他用途。</p>
  	<p>7、信息的使用：为更好地为您提供各项服务，我们将有限的使用您的相关信息，具体表现为：（1）通过合作的第三方平台对您的个人信息及支付信息进行校验，用以完成实名认证、手机绑定、支付方式绑定等工作；（2）通过向商城供应商、合作的物流机构提供您的物流及配送信息，用以完成供应商、物流机构的发货、退货及订单追踪等工作；（3）通过使用您的浏览及购买记录，用以改善商城的产品及服务，便于向您提供更加个性化的信息展示；（4）通过使用您的用户信息，用以进行基于商城数据的相关研究、统计、分析、及预测，为商城的各项决策提供产品或数据支撑；（5）便于为您提供更好服务或改善商城服务的其他用途。</p>
  	<p>9、信息的披露：商城仅在以下任一条件满足时，公开披露您的用户信息：（1）获得您明确同意或基于您的主动选择，商城可能会公开披露您的用户信息；（2）如果商城确定您出现违反法律法规或严重违反商城相关协议及规则的情况，或为保护商城用户或公众的人身财产安全免遭侵害。</p>
  	<p>10、用户信息共享、披露的豁免：以下情形中，商城共享、披露您的用户信息无需事先征得您的授权同意：（1）与国家安全、国防安全有关的；（2）与公共安全、公共卫生、重大公共利益有关的；（3）与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；（4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；（5）您自行向社会公众公开的个人信息。</p>
  	<h6>五、用户的授权</h6>
  	<p>1、关于个人信息的授权：您理解并同意，商城可以根据本协议第四条约定的内容收集、使用、披露您的个人信息。您对此表示认。</p>
  	<p>1、关于个人信息的授权：您理解并同意，商城可以根据本协议第四条约定的内容收集、使用、披露您的个人信息。您对此表示认。</p>
  	<h6>六、商城使用规则</h6>
  	<p>1、用户行为规则：本协议依据国家相关法律法规规章制定，您同意严格遵守以下义务：（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；（3）不得利用商城从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；（4）不得干扰商城的正常运转，不得侵入商城及国家计算机信息系统；（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；（6） 不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；不得教唆他人从事本条所禁止的行为；（8）不得利用在商城注册的账户进行牟利性经营活动；（9）不得发布任何侵犯他人隐私、个人信息、著作权、商标权等知识产权或合法权利的内容。</p>
  	<p>2、违反用户行为准则的后果：您须对您在网上的言论和行为承担法律责任，您若在商城上散布和传播反动、色情或其它违反国家法律的信息，商城的系统记录有可能作为您违反法律的证据。</p>
  	<p>3、商城平台的获取：商城建议您通过商城网站提供的方式获取商城软件（如手机客户端等），避免相关软件遭到第三方的篡改，如您从其他渠道获取到商城软件或与商城软件相类似的安装程序，商城将不能保证该软件能够正常使用，并对因此给您造成的损失不予负责。</p>
  	<p>4、商城平台的升级：您理解并同意商城将不定期对商城平台（包括微信小程序、手机客户端、平台网站等）进行升级，届时可能在不能事先通知您的情况下导致您无法正常登录商城平台，商城对尽快完成升级及维护工作，以便尽快为您提供服务。商城平台更新后可能发布新版本的商城软件，届时需要您对您使用的商城软件进行升级，商城不能保证您能继续使用非最新版的商城软件。</p>
  	<p>5、商城软件的禁止行为：除非法律允许或商城书面许可，否则您在使用商城软件过程中不得从事下列行为：（1）删除平台软件及其副本上关于著作权的信息；（2）对商城软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现商城软件的源代码；（3）对商城拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；（4）对商城软件或者商城软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及商城软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经商城授权的第三方工具/服务接入商城软件和相关系统；（5）通过修改或伪造软件运行中的指令、数据，增加、删减、变动商城软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</p>
  	<p>（6）通过非商城开发、授权的第三方软件、插件、外挂、系统，登录或使用商城软件及服务，或制作、发布、传播上述工具；（7）自行或者授权他人、第三方软件对商城软件及其组件、模块、数据进行干扰。</p>
  	<h6>七、违约责任</h6>
  	<p>1、如果商城发现或收到他人举报投诉您违反本协议约定的，商城有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。</p>
  	<p>2、商城有权依据合理判断对违反有关法律法规或本协议规定的行为采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，您应独自承担由此而产生的一切法律责任。</p>
  	<p>3、您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；商城因此遭受损失的，您应当一并赔偿。</p>
  	<p>4、除非另有明确的书面说明,商城不对商场的运营及其包含在本商城上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
  	<h6>八、所有权及知识产权</h6>
  	<p>1、您接受本协议后，即表明您主动将您在任何时间段在商城发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给商城所有，并且您同意商城有权就任何主体侵权而单独提起诉讼。</p>
  	<p>2、本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2010年修订版《著作权法》确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于您在商城上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
  	<p>3、您同意并已充分了解本协议的条款，承诺不将已发表于商城的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。</p>
  	<p>4、除法律另有强制性规定外，未经商城明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用商城的信息内容，否则，商城有权追究其法律责任。</p>
  	<p>5、商城所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是商城或其内容提供者的财产，受中国和国际版权法的保护。商城上所有内容的汇编是商城的排他财产，受中国和国际版权法的保护。商城上所有软件都是商城或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</p>
  	<h6>九、协议的变更</h6>
  	<p>1、协议的变更：商城可根据国家法律法规变化及维护交易秩序、保护消费者权益需要，不时修改本协议及商城各项其他协议，变更后的本协议、及商城各项其他协议（下称“变更事项”）将通过法定程序并以本协议第十条约定的方式通知您。</p>
  	<p>2、协议变更的效力：如您不同意变更事项，您有权于变更事项确定的生效日前联系商城客服反馈您的意见。如您反馈意见得以采纳，商城将酌情调整变更事项。如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用商城服务，变更事项对您不产生效力；如您在变更事项生效后仍继续使用商城服务，则视为您同意已生效的变更事项。</p>
  	<h6>十、通知</h6>
  	<p>1、有效联系方式：您在注册成为商城用户时，需提供真实有效的联系方式（包含您的电子邮箱、联系电话、联系地址等），当您预留的联系方式发生变更时，您有义务及时更新所变更的内容，以确保商城能够及时与您取得联系。</p>
  	<p>2、联系手段：商城可能通过您预留的联系方式采用其中一种或多种方式与您取得联系或向您送达通知，此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。</p>
  	<p>3、联系内容：除各类通之外，商城有权通过您注册时填写的手机号码或者电子邮箱向您推荐商品和/或广告信息、促销优惠等商业性信息；您如果不愿意接收此类信息，您有权通过商城提供的相应的退订功能进行退订。</p>
  	<p>4、通知及送达：商城通过您预留的联系方式向您发出通知，其中通过电子邮件、手机短信等电子方式发出的书面通知，您同意通过手机短信及电子邮件接收商城发送的任何通知，并认可在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</p>
  	<p>5、司法送达：对于在商城上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱账号等联系方式为您在商城预留的手机号码、电子邮箱，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。您应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。</p>
  	<h6>十一、 法律适用、管辖权及其他</h6>
  	<p>法律适用：本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例和/或行业惯例。</p>
  	<p>管辖权：您因使用商城服务所产生及与商城服务有关的争议，由商城与您协商解决。协商不成时，任何一方均可向成都市武侯区人民法院提起诉讼。</p>
  	<p>可分割性：本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</p>
  </div>
</template>

<script>
export default {
  name: 'ptfwxy',
  data () {
    return {
    	
    }
  },
  mounted(){
  	
  },
  methods:{
  	
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only  active -->
<style scoped>
	.ptfwxy{
		padding:0 .25rem;
	}
	h4{
		font-size:.34rem;
		padding:.25rem 0;
	}
	h6{
		font-size:.28rem;
		text-align: left;
		margin-top: 15px;
	}
	p{
		font-size:.26rem;
		text-align: justify;
		margin-top:.1rem;
		text-indent: 2em;
	}
</style>
