<template>
 	<div class="kela">
 		<!--公用头部-->
 		<img src="../../../static/images/activity/kelatop.jpg"/>
 		<div class="content">
 			<div class="first">
	 			<p>尊敬的用户（以下简称为“您”）您好，欢迎您使用斗宝俱乐部，现您与斗宝俱乐部(包含微信小程序、手机客户端、网站等平台，以下简称为“俱乐部”)经营者成都斗宝科技有限公司就俱乐部“克拉”的相关服务事宜进行明确，并自愿签订本协议使用俱乐部“克拉”服务。</p>
	 			<p>在您申请注册流程中点击同意本协议之前，请您仔细阅读本协议，充分理解各项条款的内容及含义，特别对于注意事项或权利限制的相关内容及关于法律适用与争议解决内容的相关部分，请您着重阅读。</p>
	 			<p>您在认真阅读并充分理解本协议的相关内容后，您通过点击“确认”或“下一步”将代表您已完全理解并认可本协议的全部条款。</p>
	 			<p>如您在阅读本协议的的过程中，有任何疑问，可通过俱乐部客服进行咨询；如您不同意本协议或其中任意条款约定，请您立即停止开通俱乐部“克拉”服务。</p>
	 			<p>本协议各段标题及各条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为准确理解各项条款的相关内容，建议您仔细阅读各条款具体表述。</p>
 			</div>
 			<h4>一、“克拉”的定义</h4>
 			<div class="first">
 				<p>克拉”为斗宝俱乐部内部用于支付商品价款的计量单位，您在俱乐部购物过程中，“克拉”具有与现实货币（仅限为人民币，下同，以下简称为“现实货币”）同等的购买力，当您使用“克拉”时，具有与现实货币同等的购买力，俱乐部有权为每一件商品设定“克拉”的使用规则。</p>
 				<p>       “克拉”仅能用于购买斗宝俱乐部销售的商品及服务不能兑换现实货币，不能在俱乐部用户间进行有偿转让，不能兑换斗宝俱乐部体系外的产品和服务。</p>
 			</div>
 			<h4>二、“克拉”的获取</h4>
 			<div class="first">
 				<p>您将通过以下方式获得俱乐部“克拉”：</p>
 				<p>1、第三方充值：与俱乐部具有商务合作关系的第三方机构可能通过三方签署相关协议的方式为其指定的俱乐部用户批量充值“克拉”。</p>
 				<p>2、购买“克拉”：您可以通过使用现实货币通过俱乐部或俱乐部授权的第三方直接购买俱乐部“克拉”；或通过上述途径购买“克拉”储值卡。并通过使用“克拉”储值卡为您指定的账户充值“克拉”。俱乐部购物储值卡不记名、不挂失。</p>
 				<p>3、俱乐部活动获取“克拉”：俱乐部可能通过俱乐部活动等方式为您提供“克拉”，俱乐部不对赠与您的“克拉”额度做出任何承诺，俱乐部与您另有约定除外。</p>
 			</div>
 			<h4>三、“克拉”的使用</h4>
 			<div class="first">
 				<p>       “克拉”仅限于在斗宝俱乐部体系内购买产品和服务使用。您可以通过以下方式使用您账户中的“克拉”。</p>
 				<p>1、购买商品及服务：您可通过购买俱乐部内销售的商品及服务来使用您的”克拉”，使用“克拉”将等额抵消实际支付的商品价款，俱乐部有权为每一件商品设定“克拉”的使用规则。</p>
 				<p>2、赠与俱乐部用户：您可以将您账户中的“克拉”全部或部分赠与俱乐部其他用户，若您希望如此，您须在使用此项功能前完成俱乐部实名认证流程。</p>
 			</div>
 			<h4 class="special">四、“克拉”的使用中的注意事项</h4>
 			<div class="first">
 				<p>1、不可拆分使用：俱乐部有权为每一件商品设定“克拉”的使用规则，当您持有的“克拉”数量不足时，您不能通过自行调整“克拉”与现实货币的支付比例的方式进行结算，即同一商品在同一时刻能够使用的现金与“克拉”比例为固定值。在此情况下，如您持有的“克拉”数量不足，您将不能使用“克拉”进行消费。</p>
 				<p>2、使用“克拉”后的退货：当您在俱乐部购买商品或服务并使用“克拉”进行结算后，需要办理退货手续时，俱乐部将按照您购买商品或服务时支付的现实货币金额与“克拉”数量，通过原路径向您退还同等金额的现实货币及同等数量的“克拉”。</p>
 				<p>3、不可冲低运费：俱乐部“克拉”仅可用于支付商品及服务的商品价款，不能用于结算商品运费，当您在俱乐部购买商品时，如需您支付商品运费，您仅能通过支付现实货币的方式支付商品运费。</p>
 				<p>4、不可有偿转让：俱乐部禁止俱乐部用户之间对“克拉”进行任何形式的有偿转让行为。</p>
 				<p>5、不可兑换现实货币：俱乐部“克拉”在任何条件下均无法通过俱乐部兑换现实货币。</p>
 			</div>
 			<h4>五、协议的变更</h4>
 			<div class="first">
 				<p>1、协议的变更：俱乐部可根据国家法律法规变化及维护俱乐部交易秩序需要，不时对本协议进行调整及修改（以下简称变更事项），变更后的本协议通过俱乐部官网公示的方式通知您。</p>
 				<p>2、协议变更的效力：如您不同意变更事项，您有权于变更事项确定的生效日前联系俱乐部协商解决。如您在变更事项生效前未就变更事项与俱乐部进行有效的协商，则视为您同意已生效的变更事项。</p>
 			</div>
 		</div>
  </div>
</template>

<script>
	export default {
	  name: 'coupon',
	  data () {
	    return {
	    }
	  }
	}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style>
body{padding-bottom: 0 !important;}
</style>
<style scoped>
.kela {
	background-color:#f94379;
	padding-bottom:.2rem;
}
.kela img{
	width:100%;
}
.kela .content{
	background-color:#fff;
	width:6.4rem;
	padding:0 .35rem;
	margin:0 auto;
	-webkit-border-radius:5px;
}
.kela .content .first{
	padding-bottom: .45rem;
}
.kela .content p{
	font-size: .24rem;
	color:#333333;
	text-align: justify;
	padding-top: .45rem;
	line-height:.4rem;
	text-indent: 2em;
}
.kela .special{
	width:4.1rem;
}
.kela h4{
	font-size: .24rem;
	color:#ffffff;
	background-color:#f94379;
	width:2.66rem;
	height:.51rem;
	line-height:.51rem;
	-webkit-border-radius:.4rem;
}
</style>
